app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "text", "categories", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "kasj"], ["text", "kjasbk"], ["categories", "aksjd"], ["created_at", "2015-03-31 19:30:10.966534"], ["updated_at", "2015-03-31 19:30:10.966534"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save